tap "codeship/taps"
tap "common-fate/granted"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/services"
tap "minamijoyo/hcledit"
tap "romkatv/powerlevel10k"
# Run your GitHub Actions locally
brew "act"
# General-purpose lossless data-compression library
brew "zlib"
# General-purpose data compression with high compression ratio
brew "xz"
# New file format for still image compression
brew "jpeg-xl"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Portable Foreign Function Interface library
brew "libffi"
# Library for command-line editing
brew "readline"
# GNU database manager
brew "gdbm"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Encode and decode base64 files
brew "base64"
# Programmable completion for Bash 4.2+
brew "bash-completion@2"
# Parser generator
brew "bison"
# Python code formatter
brew "black"
# YAML Parser
brew "libyaml"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Prevent cloud misconfigurations during build-time for IaC tools
brew "checkov"
# Ruby environment tool
brew "chruby"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: true
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Lint your Python code for style and logical errors
brew "flake8"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Version Control Visualization Tool
brew "gource"
# Kubernetes package manager
brew "helm"
# Convert a JSON IAM Policy into terraform
brew "iam-policy-json-to-terraform"
# Cost estimates for Terraform
brew "infracost"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Utility for directing compilation
brew "make"
# Run a Kubernetes cluster locally
brew "minikube"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Theme for zsh
brew "powerlevel10k"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# It's not just a linter that annoys you!
brew "pylint"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Keccak, SHA-3, SHAKE, and RawSHAKE checksum utilities
brew "sha3sum"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Editor of encrypted files
brew "sops"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Cross-shell prompt for astronauts
brew "starship"
# Tool Command Language
brew "tcl-tk"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Detect compliance and security violations across Infrastructure as Code
brew "terrascan"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Update version constraints in your Terraform configurations
brew "tfupdate"
# Terragrunt version manager inspired by tfenv
brew "tgenv"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Linter for YAML files
brew "yamllint"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# The easiest way to access your cloud.
brew "common-fate/granted/granted"
# A command line editor for HCL
brew "minamijoyo/hcledit/hcledit"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Cloud native persistent desktop virtualization
cask "amazon-workspaces"
# Manage team projects and tasks
cask "asana"
# Managed client-based VPN service to securely access AWS resources
cask "aws-vpn-client"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# CI/CD as a service
cask "jet"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Remote desktop client
cask "microsoft-remote-desktop"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Command-line shell and scripting language
cask "powershell"
# IDE for Python programming - Community Edition
cask "pycharm-ce"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
vscode "4ops.packer"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "atlassian.atlascode"
vscode "aws-scripting-guy.cform"
vscode "ban.spellright"
vscode "Bridgecrew.checkov"
vscode "dannysteenman.cloudformation-yaml-snippets"
vscode "deibit.devdocs"
vscode "eamodio.gitlens"
vscode "GitHub.codespaces"
vscode "github.vscode-github-actions"
vscode "GitLab.gitlab-workflow"
vscode "golang.go"
vscode "GrapeCity.gc-excelviewer"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "owenfarrell.vscode-vault"
vscode "puppet.puppet-vscode"
vscode "rebornix.ruby"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "Shopify.ruby-lsp"
vscode "wingrunr21.vscode-ruby"
